USER EXEC mode - Router> type en
Privileged EXEC mode - Router# type conf t
Global Conf. mode - Router(config)#

Diff: END and EXIT in CLI?

Command :
#sh ip int br
#sh run
#sh run | sec int
#sh star
#cop r st
#int g0/0/0
#ip add 192.168.10.1 255.255.255.0
#no shut
#do cop r st // when u are not in privilege mode.
Router(config)#hostname PG-ROUTER
PG-ROUTER(config)#

---------------
SSH
Step 1:
Configure the domain name to be netacad.pka.
S1(config)# ip domain-name netacad.pka
Secure keys are needed to encrypt the data. Generate the RSA keys using a 1024 key length.
S1(config)# crypto key generate rsa
The name for the keys will be: S1.netacad.pka
Choose the size of the key modulus in the range of 360 to 2048 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 1024

Step 2: 
Create an SSH user and reconfigure the VTY lines for SSH-only access. 
Create an administrator user with cisco as the secret password.
S1(config)# username administrator secret cisco

Configure the VTY lines to check the local username database for login credentials and to only allow SSH for remote access. Remove the existing vty line password.
S1(config)# line vty 0 15
S1(config-line)# login local
S1(config-line)# transport input ssh
--------------------
S1(config-line)# no password telnet

Create SSH version 2
S1(config)#ip ssh version 2

Verify SSH:
S1#sh ip ssh 